In [2]:
import pandas as pd
import numpy as np 
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman','Batman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip',np.nan],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT,np.nan]})
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT
3    Batman        NaN        NaT

In [ ]:
df.loc[df['type'] == 'N']

In [ ]:
unicodedata.normalize('NFKC', '7778\xa0zł/m²')

int(float('579837.13'))

In [ ]:
df.replace({'a' : { 'Medium' : 2, 'Small' : 1, 'High' : 3 }})

In [ ]:
TERYT
https://eteryt.stat.gov.pl/eTeryt/rejestr_teryt/aktualnosci/aktualnosci.aspx

In [7]:
import pandas as pd
df = pd.DataFrame

In [ ]:
df2.loc[882,'where']
df.to_csv('./out.csv',sep=';')

In [6]:
lst = [1,2,3,4,5]

def x(s=None,e=None):
    return lst[s:e]

x(e=2)

[1, 2]

In [23]:
help = df.loc[:,['name','toy']]
help= help[help['toy'].notna()]

df[df['toy'].isna()]

     name  toy born
0  Alfred  NaN  NaT
3  Batman  NaN  NaT

In [37]:
def history_fill(main_df:pd.DataFrame,source_df:pd.DataFrame,fill_col:str,join_col:str):
    main_df[fill_col].fillna(pd.merge(main_df,source_df,how='left',on=join_col,suffixes=('', '_new'))[fill_col+'_new'],inplace=True)

history_fill(df,help,'toy','name')
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT
3    Batman  Batmobile        NaT

In [40]:
# 
def add_empty_col(colname:str):
    if colname not in df.columns:
        df[colname] = np.nan
add_empty_col('rex')

In [47]:
df.shape[0]
int('5015.67')

ValueError: invalid literal for int() with base 10: '5015.67'